ImportError = 'ImportError – ошибка при импортировании (загрузке) модуля. Связана, скорее всего, с ошибкой в имени модуля.'
IndexError = 'IndexError - ошибка при обращении к списку или кортежу. Скорее всего, имеется обращение к списку(кортежу) по несуществующему индексу этого списка'
MemoryError = 'MemoryError – ошибка при переполнении памяти.'
NameError = 'NameError– ошибка имени. Возникает, когда в коде идет обращение к переменной, которая не была объявлена заранее.'
SyntaxError = 'SyntaxError – синтаксическая ошибка. Отсутствует знак препинания: " ) (   и т.д'
TypeError = 'TypeError– ошибка, возникающая при попытке проведения недопустимых операций над значениями, принадлежащими разным типам данных. Например попытка сложить целое число со строкой.'
ZeroDivisionError = 'ZeroDivisionError – ошибка при попытке деления на ноль, что недопустимо с точки зрения математики. Например попытка делить на ноль'

